app/views/imports_scenarios/_show.html.haml

SELECT `scenario_steps`.* FROM `scenario_steps` WHERE `scenario_steps`.`scenario_id` = '4'
---
  %h4= @scenario.name
  - @scenario.scenario_steps.each do |step|