app/views/requests/_form.html.haml

SELECT `tags`.* FROM `tags`
---
      %label{ for: 'tags' }= 'Tags'
      = f.select :tags, options_from_collection_for_select(ActsAsTaggableOn::Tag.all, :id, :name), {},
        { multiple: true, class: 'form-control' }