app/views/requests/index.html.haml

              - request.tags.split(',').each do |tag|
                %text.tag= ActsAsTaggableOn::Tag.find_by(id: tag)
---
SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 5 LIMIT 1