app/views/requests/show.html.haml

            - @request.tags.split(',').each do |tag|
              %text.tag= ActsAsTaggableOn::Tag.find_by(id: tag)
---
SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 15 LIMIT 1