app/views/scenarios/_form.html.haml

SELECT `scenarios`.* FROM `scenarios`
---
                  %div.form-group{ class: 'col-sm-4' }
                    = steps.select :step_type, Scenario::STEPS, { include_blank: 'Select a Test Plan step' },
                      { class: 'form-control select-box' }