app/controllers/imports_scenarios_controller.rb

  def index
    @scenarios = Scenario.all
---
SELECT `scenarios`.* FROM `scenarios`

  def show
    @scenario = Scenario.includes(:scenario_steps).find(params[:id])
---
SELECT  `scenarios`.* FROM `scenarios` WHERE `scenarios`.`id` = 4 LIMIT 1
SELECT `scenario_steps`.* FROM `scenario_steps` WHERE `scenario_steps`.`scenario_id` = '4'