app/controllers/parameters_controller.rb

  def new
    scenario = Scenario.find(params[:scenario_id])
---
SELECT  `scenarios`.* FROM `scenarios` WHERE `scenarios`.`id` = 16 LIMIT 1