app/controllers/requests_controller.rb

SELECT `requests`.* FROM `requests` ORDER BY `requests`.`created_at` ASC
---
  def index
    @requests = Request.all.order(:created_at).reverse

INSERT INTO `requests` (`id`, `tags`, `created_by`, `created_at`, `updated_at`, `description`, `solution_id`) VALUES ('0e30111b-b348-4ca6-b210-a9741fa66bd0', '15', 'AS062052', '2018-09-04 06:03:07', '2018-09-04 06:03:07', 'JIRA Number: HIANDEV-XXXX\r\n                                          Solution: HealtheAnalytics\r\n                                          Test Date: 10-May-2017\r\n                                          Environment: Staging\r\n                                          Operating System: OS-X\r\n                                          Associate ID: AA00000\r\n                                          Prerequisite Evidence: N/A', 1)
---
  def create
    @request = Request.new(request_params)
    @request.created_by = session[:associate_id]

SELECT  `requests`.* FROM `requests` WHERE `requests`.`id` = '962052aa-0f25-43e0-a458-b8a3b667ce77' LIMIT 1
---
    def set_request
      @request = Request.find(params[:id])