app/controllers/scenarios_controller.rb

SELECT `scenarios`.* FROM `scenarios`
---
  def index
    if params[:tag].present?
      @scenarios = Scenario.tagged_with(params[:tag])
    else
      @scenarios = Scenario.all

SELECT `scenarios`.* FROM `scenarios` WHERE `scenarios`.`created_by` = 'AS062052'
---
  def mytestplan
    @scenarios = Scenario.where(:created_by => session[:associate_id])

SELECT `scenarios`.* FROM `scenarios` WHERE (`scenarios`.`created_by` != 'AS062052')
---
  def othertestplan
    @scenarios = Scenario.where.not(:created_by => session[:associate_id])

INSERT INTO `scenarios` (`name`, `created_at`, `updated_at`, `description`, `created_by`, `solution_id`) VALUES ('crucible', '2018-09-04 06:59:33', '2018-09-04 06:59:33', 'sample test', 'AS062052', 1)
---
  def create
    # check for add in steps

    if params['scenario']['scenario_steps_attributes'] && params['scenario']['scenario_steps_attributes'].keys.grep(/_scenario_steps/).present?
      params['scenario']['scenario_steps_attributes'] = add_in_params_with_order(
        params['scenario']['scenario_steps_attributes']
      )
    end

    @scenario = Scenario.new(scenario_params)
    @scenario.created_by = session[:associate_id]

DELETE FROM `scenario_steps` WHERE `scenario_steps`.`id` = 163
UPDATE `scenario_steps` SET `step_type` = 'fill_in', `step_value` = 'q|cenner', `updated_at` = '2018-09-07 05:22:06' WHERE `scenario_steps`.`id` = 163
UPDATE `scenarios` SET `name` = 'create new test plan', `description` = 'createing new test', `updated_by` = 'AS062052', `updated_at` = '2018-09-12 05:09:56' WHERE `scenarios`.`id` = 17
---
  def update
    # check for add in steps
    if params['scenario']['scenario_steps_attributes'].present?
      if params['scenario']['scenario_steps_attributes'].keys.grep(/_scenario_steps/).present?
      # clear all steps for reordering
        @scenario.steps.destroy_all

        params['scenario']['scenario_steps_attributes'] = add_in_params_with_order(
        params['scenario']['scenario_steps_attributes']
      )
      end
    end
    respond_to do |format|
      if @scenario.update(scenario_params.merge(updated_by: session[:associate_id]))

INSERT INTO `scenarios` (`name`, `created_at`, `updated_at`, `description`, `created_by`, `updated_by`, `solution_id`) VALUES ('Copy_date_0', '2018-09-25 09:15:04', '2018-09-25 09:15:04', 'dsnak,', 'AS062052', 'AS062052', 1)
---
  def copy
   @scenario = Scenario.clone(params['copy_id'])
   if !@scenario
    render :json => { error_message: 'Error Occurred' }, status: :unprocessable_entity
   else
    @scenario.created_by = session[:associate_id]

SELECT  `scenarios`.* FROM `scenarios` WHERE (name LIKE 'Copy_date%') ORDER BY `scenarios`.`id` DESC LIMIT 1
---
    def set_scenario
      @scenario = Scenario.find(params[:id])