app/controllers/solutions_controller.rb

SELECT "solutions".* FROM "solutions" ORDER BY created_at desc
---
  def index
    @solutions = Solution.all.order('created_at desc')

INSERT INTO "solutions" ("name", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "adhi test"], ["created_by", "AS062052"], ["created_at", "2018-09-03 11:51:33.170976"], ["updated_at", "2018-09-03 11:51:33.170976"]]
---
  def create
    @solution = Solution.new(solution_params)
    @solution.created_by = session[:associate_id]

SELECT  `solutions`.* FROM `solutions` WHERE `solutions`.`id` = 1 LIMIT 1
SELECT "solution_configurations".* FROM "solution_configurations" WHERE "solution_configurations"."solution_id" = ?  [["solution_id", 1]]
---
    def set_solution
      @solution = Solution.includes(:solution_configurations).find(params[:id])