app/views/parameters/_form.html.haml

SELECT `parameters`.* FROM `parameters`
---
  %tbody
    - Parameter.all.each do |parameter|